espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/bluetooth/common/btmesh_sensor_server/sl_btmesh_sensor_server_cadence.c
/***************************************************************************//**
 * @file
 * @brief BT Mesh Sensor Server cadence handler
 *******************************************************************************
 * # License
 * <b>Copyright 2020 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

// C Standard Library headers
#include <stdio.h>
#include "sl_status.h"
// Bluetooth stack headers
#include "sl_btmesh_api.h"
#include "sl_btmesh_sensor.h"

#include "app_assert.h"
#include "em_common.h"

#include "sl_board_control_config.h"

#ifdef SL_CATALOG_SENSOR_RHT_PRESENT
#include "sl_sensor_rht_config.h"
#include "sl_sensor_rht.h"
#endif // SL_CATALOG_SENSOR_RHT_PRESENT

#ifdef SL_CATALOG_BTMESH_SENSOR_PEOPLE_COUNT_PRESENT
#include "sl_btmesh_sensor_people_count_config.h"
#include "sl_btmesh_sensor_people_count.h"
#endif // SL_CATALOG_BTMESH_SENSOR_PEOPLE_COUNT_PRESENT

#include "sl_btmesh_sensor_server.h"
#include "sl_btmesh_sensor_server_cadence.h"

// Warning! The app_btmesh_util shall be included after the component configuration
// header file in order to provide the component specific logging macro.
#include "app_btmesh_util.h"

/// Shift 7 positions
#define STATUS_TRIGGER_TYPE_SHIFT                         7
/// Shift 8 positions
#define FAST_CADENCE_DELTA_SHIFT                          8
/// Length of people count sensor get cadence status buffer
#define SENSOR_PEOPLE_COUNT_GET_CADENCE_BUF_LEN           10
/// Length of thermometer (discrete trigger type) get cadence status buffer
#define SENSOR_THERMOMETER_DISCRETE_GET_CADENCE_BUF_LEN   6
/// Length of thermometer (percentage trigger type) get cadence status buffer
#define SENSOR_THERMOMETER_PERCENTAGE_GET_CADENCE_BUF_LEN 8
/// Length of people count sensor set cadence parameter buffer
#define SENSOR_PEOPLE_COUNT_CADENCE_PARAM_LEN             9
/// Length of thermometer (discrete trigger type) set cadence status buffer
#define SENSOR_THERMOMETER_CADENCE_PERCENTAGE_PARAM_LEN   7
/// Length of thermometer (percentage trigger type) set cadence status buffer
#define SENSOR_THERMOMETER_CADENCE_DISCRETE_PARAM_LEN     5
/// Cadence period divisor parameter maximum value
#define MAX_PERIOD_DIVISOR                                0x0F
/// Cadence trigger type parameter maximum value
#define MAX_TRIGGER_TYPE                                  0x01
/// Cadence minimum interval parameter maximum value
#define MAX_PUBLISHING_MIN_INTERVAL                       0x1A
/// Percentage 100.00%
#define PERCENTAGE_FULL                                   10000

// Define the sensor index
// RHT sensor present and cadence enabled
#if SENSOR_THERMOMETER_CADENCE
#define SENSOR_RHT_INDEX                                  0

// RHT and people count sensor present
#if SENSOR_PEOPLE_COUNT_CADENCE
#define SENSOR_PEOPLE_COUNT_INDEX                         1
#endif // SENSOR_PEOPLE_COUNT_CADENCE

// RHT sensor not present, people count sensor present
#elif SENSOR_PEOPLE_COUNT_CADENCE
#define SENSOR_PEOPLE_COUNT_INDEX                         0
#endif // SENSOR_PEOPLE_COUNT_CADENCE

#if SENSOR_THERMOMETER_CADENCE || SENSOR_PEOPLE_COUNT_CADENCE
// Cadence parameters of supported sensors
static struct sensort_cadence_state cadences[SENSOR_THERMOMETER_CADENCE
                                             + SENSOR_PEOPLE_COUNT_CADENCE];

static int delta_abs (int val);
#endif

#if SENSOR_PEOPLE_COUNT_CADENCE
/// Previously measured people count value
static count16_t prev_people_count_data;

// People count sensor internals
static bool sensor_people_count_fast_cadence(count16_t people_count);
static bool sensor_people_count_delta_cadence(count16_t people_count);
#endif // SENSOR_PEOPLE_COUNT_CADENCE

#if SENSOR_THERMOMETER_CADENCE
/// Previously measured temperature value
static temperature_8_t prev_temp_data;

// Thermometer sensor internals
static bool sensor_thermometer_fast_cadence(temperature_8_t current_temperature);
static bool sensor_thermometer_delta_cadence(temperature_8_t current_temperature);
#endif // SENSOR_THERMOMETER_CADENCE

#if SENSOR_PEOPLE_COUNT_CADENCE

void sl_btmesh_sensor_people_count_cadence_init(count16_t people_count)
{
  static uint16_t delta_down =  SL_BTMESH_SENSOR_PEOPLE_COUNT_STATUS_TRIGGER_DELTA_DOWN_CFG_VAL;
  static uint16_t delta_up =  SL_BTMESH_SENSOR_PEOPLE_COUNT_STATUS_TRIGGER_DELTA_UP_CFG_VAL;

  static uint16_t cadence_low =  SL_BTMESH_SENSOR_PEOPLE_COUNT_FAST_CADENCE_LOW_CFG_VAL;
  static uint16_t cadence_high =  SL_BTMESH_SENSOR_PEOPLE_COUNT_FAST_CADENCE_HIGH_CFG_VAL;

  cadences[SENSOR_PEOPLE_COUNT_INDEX].property_id = PEOPLE_COUNT;
  cadences[SENSOR_PEOPLE_COUNT_INDEX].period_divisor =  SL_BTMESH_SENSOR_PEOPLE_COUNT_FAST_CADENCE_PERIOD_DIVISOR_CFG_VAL;
  cadences[SENSOR_PEOPLE_COUNT_INDEX].status_trigger_type =  SL_BTMESH_SENSOR_PEOPLE_COUNT_STATUS_TRIGGER_TYPE_CFG_VAL;
  cadences[SENSOR_PEOPLE_COUNT_INDEX].min_interval =  SL_BTMESH_SENSOR_PEOPLE_COUNT_STATUS_MIN_INTERVAL_CFG_VAL;
  cadences[SENSOR_PEOPLE_COUNT_INDEX].fast_cadence_low.size = sizeof(cadence_low);
  cadences[SENSOR_PEOPLE_COUNT_INDEX].fast_cadence_low.value = (uint8_t*)(&cadence_low);
  cadences[SENSOR_PEOPLE_COUNT_INDEX].fast_cadence_high.size = sizeof(cadence_high);
  cadences[SENSOR_PEOPLE_COUNT_INDEX].fast_cadence_high.value = (uint8_t*)(&cadence_high);
  cadences[SENSOR_PEOPLE_COUNT_INDEX].status_trigger_delta_down.size = sizeof(delta_down);
  cadences[SENSOR_PEOPLE_COUNT_INDEX].status_trigger_delta_down.value = (uint8_t*)(&delta_down);
  cadences[SENSOR_PEOPLE_COUNT_INDEX].status_trigger_delta_up.size = sizeof(delta_up);
  cadences[SENSOR_PEOPLE_COUNT_INDEX].status_trigger_delta_up.value = (uint8_t*)(&delta_up);

  prev_people_count_data = people_count;
}

uint32_t sl_btmesh_sensor_people_count_handle_cadence(count16_t people_count, sl_btmesh_evt_sensor_server_publish_t publish_period)
{
  uint32_t ret_timer_value = publish_period.period_ms;

  // Check if the measured value requires publishing period modification
  if (sensor_people_count_delta_cadence(people_count)
      || sensor_people_count_fast_cadence(people_count)) {
    // Calculate new publishing timer value
    ret_timer_value = publish_period.period_ms / (1 << cadences[SENSOR_PEOPLE_COUNT_INDEX].period_divisor);
    if (ret_timer_value < (uint32_t)(1 << cadences[SENSOR_PEOPLE_COUNT_INDEX].min_interval)) {
      ret_timer_value = (uint32_t)(1 << cadences[SENSOR_PEOPLE_COUNT_INDEX].min_interval);
    }
  }
  prev_people_count_data = people_count;

  return ret_timer_value;
}

bool sl_btmesh_sensor_people_count_set_cadence(sl_btmesh_evt_sensor_setup_server_set_cadence_request_t* evt)
{
  bool ret_val = false;

