espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/bluetooth/common/btmesh_sensor_server/sl_btmesh_sensor_server_cadence.c
  // Check if the received parameters are in valid range
  if ((SENSOR_PEOPLE_COUNT_CADENCE_PARAM_LEN == evt->params.len)
      && (MAX_PERIOD_DIVISOR >= evt->period_divisor)
      && (MAX_TRIGGER_TYPE >= evt->trigger_type)
      && (MAX_PUBLISHING_MIN_INTERVAL >= evt->params.data[4])) {
    ret_val = true;
  }

  // Store incoming people count sensor cadence parameters
  if (true == ret_val) {
    cadences[SENSOR_PEOPLE_COUNT_INDEX].period_divisor = evt->period_divisor;
    cadences[SENSOR_PEOPLE_COUNT_INDEX].status_trigger_type = evt->trigger_type;
    cadences[SENSOR_PEOPLE_COUNT_INDEX].status_trigger_delta_down.value[0] = evt->params.data[0];
    cadences[SENSOR_PEOPLE_COUNT_INDEX].status_trigger_delta_down.value[1] = evt->params.data[1];
    cadences[SENSOR_PEOPLE_COUNT_INDEX].status_trigger_delta_up.value[0] = evt->params.data[2];
    cadences[SENSOR_PEOPLE_COUNT_INDEX].status_trigger_delta_up.value[1] = evt->params.data[3];
    cadences[SENSOR_PEOPLE_COUNT_INDEX].min_interval = evt->params.data[4];
    cadences[SENSOR_PEOPLE_COUNT_INDEX].fast_cadence_low.value[0] = evt->params.data[5];
    cadences[SENSOR_PEOPLE_COUNT_INDEX].fast_cadence_low.value[1] = evt->params.data[6];
    cadences[SENSOR_PEOPLE_COUNT_INDEX].fast_cadence_high.value[0] = evt->params.data[7];
    cadences[SENSOR_PEOPLE_COUNT_INDEX].fast_cadence_high.value[1] = evt->params.data[8];
  }

  return ret_val;
}

uint16_t sl_btmesh_sensor_people_count_get_cadence(uint8_t length, uint8_t* get_cadence_buffer)
{
  uint16_t buffer_len = 0;

  if (SENSOR_PEOPLE_COUNT_GET_CADENCE_BUF_LEN <= length) {
    get_cadence_buffer[0] = cadences[SENSOR_PEOPLE_COUNT_INDEX].period_divisor
                            | (cadences[SENSOR_PEOPLE_COUNT_INDEX].status_trigger_type << STATUS_TRIGGER_TYPE_SHIFT);
    get_cadence_buffer[1] = cadences[SENSOR_PEOPLE_COUNT_INDEX].status_trigger_delta_down.value[0];
    get_cadence_buffer[2] = cadences[SENSOR_PEOPLE_COUNT_INDEX].status_trigger_delta_down.value[1];
    get_cadence_buffer[3] = cadences[SENSOR_PEOPLE_COUNT_INDEX].status_trigger_delta_up.value[0];
    get_cadence_buffer[4] = cadences[SENSOR_PEOPLE_COUNT_INDEX].status_trigger_delta_up.value[1];
    get_cadence_buffer[5] = cadences[SENSOR_PEOPLE_COUNT_INDEX].min_interval;
    get_cadence_buffer[6] = cadences[SENSOR_PEOPLE_COUNT_INDEX].fast_cadence_low.value[0];
    get_cadence_buffer[7] = cadences[SENSOR_PEOPLE_COUNT_INDEX].fast_cadence_low.value[1];
    get_cadence_buffer[8] = cadences[SENSOR_PEOPLE_COUNT_INDEX].fast_cadence_high.value[0];
    get_cadence_buffer[9] = cadences[SENSOR_PEOPLE_COUNT_INDEX].fast_cadence_high.value[1];
    buffer_len = SENSOR_PEOPLE_COUNT_GET_CADENCE_BUF_LEN;
  }

  return buffer_len;
}

/***************************************************************************//**
 * Check if the measured value requires publishing period modification.
 *
 * @param[in] people_count    People count sensor data value
 *
 * @return True if publishing period modification is required false otherwise
 ******************************************************************************/
static bool sensor_people_count_fast_cadence(count16_t people_count)
{
  bool ret_val = false;
  count16_t fast_cadence_high = (count16_t)(cadences[SENSOR_PEOPLE_COUNT_INDEX].fast_cadence_high.value[0]
                                            | (cadences[SENSOR_PEOPLE_COUNT_INDEX].fast_cadence_high.value[1] << FAST_CADENCE_DELTA_SHIFT));
  count16_t fast_cadence_low  = (count16_t)(cadences[SENSOR_PEOPLE_COUNT_INDEX].fast_cadence_low.value[0]
                                            | (cadences[SENSOR_PEOPLE_COUNT_INDEX].fast_cadence_low.value[1] << FAST_CADENCE_DELTA_SHIFT));

  // Check if the Fast Cadence High value is equal or higher than the Fast Cadence Low value
  if (fast_cadence_high >= fast_cadence_low) {
    // If the measured value is within the closed interval of
    // [Fast Cadence Low, Fast Cadence High], Sensor Status publishing period
    // modification is required.
    if ((people_count >= fast_cadence_low)
        && (people_count <= fast_cadence_high)) {
      ret_val = true;
    }
    // Check if the Fast Cadence High value is lower than the Fast Cadence Low value
  } else {
    // If the measured value is lower than the Fast Cadence High value or is
    // higher than the Fast Cadence Low value, Sensor Status publishing period
    // modification is required.
    if ((people_count < fast_cadence_high)
        || (people_count > fast_cadence_low)) {
      ret_val = true;
    }
  }

  return ret_val;
}

/***************************************************************************//**
 * Check if the change of the measured value requires publishing period modification.
 *
 * @param[in] people_count    People count sensor data value
 *
 * @return True if publishing period modification is required false otherwise
 ******************************************************************************/
static bool sensor_people_count_delta_cadence(count16_t people_count)
{
  bool ret_val = false;
  uint16_t delta_percent;
  uint16_t delta_cadence_up = (uint16_t)(cadences[SENSOR_PEOPLE_COUNT_INDEX].status_trigger_delta_up.value[0]
                                         | (cadences[SENSOR_PEOPLE_COUNT_INDEX].status_trigger_delta_up.value[1] << FAST_CADENCE_DELTA_SHIFT));
  uint16_t delta_cadence_down = (uint16_t)(cadences[SENSOR_PEOPLE_COUNT_INDEX].status_trigger_delta_down.value[0]
                                           | (cadences[SENSOR_PEOPLE_COUNT_INDEX].status_trigger_delta_down.value[1] << FAST_CADENCE_DELTA_SHIFT));

  // Check the unit and format of the Status Trigger Delta Down and
  // the Status Trigger Delta Up fields.
  if (SL_BTMESH_SENSOR_PEOPLE_COUNT_STATUS_TRIGGER_TYPE_DISCRETE_VALUE_CFG_VAL == cadences[SENSOR_PEOPLE_COUNT_INDEX].status_trigger_type) {
    // If the temperature change is rising and the measured quantity change
    // exceeds the configured Status Trigger Delta Up value, Sensor Status
    // publishing period modification is required.
    if ((people_count > prev_people_count_data)
        && ((people_count - prev_people_count_data) >= (count16_t)delta_cadence_up)) {
      ret_val = true;
      // If the temperature change is falling and the measured quantity change
      // exceeds the configured Status Trigger Delta Down value, Sensor Status
      // publishing period modification is required.
    } else if ((people_count < prev_people_count_data)
               && ((prev_people_count_data - people_count) >= (count16_t)delta_cadence_down)) {
      ret_val = true;
    } else {
    }
    // Same check with measured value represented unitless as percentage
  } else if ((SL_BTMESH_SENSOR_PEOPLE_COUNT_STATUS_TRIGGER_TYPE_PERCENTAGE_CFG_VAL == cadences[SENSOR_PEOPLE_COUNT_INDEX].status_trigger_type)
             && (prev_people_count_data != people_count)) {
    if (!prev_people_count_data) {
      delta_percent = PERCENTAGE_FULL;
    } else {
      delta_percent = delta_abs((delta_abs(prev_people_count_data - people_count) * PERCENTAGE_FULL) / prev_people_count_data);
    }

    if ((people_count > prev_people_count_data) && (delta_percent >= delta_cadence_up)) {
      ret_val = true;
    } else if ((people_count < prev_people_count_data) && (delta_percent >= delta_cadence_down)) {
      ret_val = true;
    } else {
    }
  } else {
  }

