espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/bluetooth/common/btmesh_sensor_server/sl_btmesh_sensor_server_cadence.c
  return ret_val;
}

#endif // SENSOR_PEOPLE_COUNT_CADENCE

#if SENSOR_THERMOMETER_CADENCE

void sl_btmesh_sensor_thermometer_cadence_init(temperature_8_t temperature)
{
  static uint16_t delta_down =  SENSOR_THERMOMETER_STATUS_TRIGGER_DELTA_DOWN;
  static uint16_t delta_up =  SENSOR_THERMOMETER_STATUS_TRIGGER_DELTA_UP;

  static uint8_t cadence_low =  SENSOR_THERMOMETER_FAST_CADENCE_LOW;
  static uint8_t cadence_high =  SENSOR_THERMOMETER_FAST_CADENCE_HIGH;

  cadences[SENSOR_RHT_INDEX].property_id = PRESENT_AMBIENT_TEMPERATURE;
  cadences[SENSOR_RHT_INDEX].period_divisor =  SENSOR_THERMOMETER_FAST_CADENCE_PERIOD_DIVISOR;
  cadences[SENSOR_RHT_INDEX].status_trigger_type =  SENSOR_THERMOMETER_STATUS_TRIGGER_TYPE;
  cadences[SENSOR_RHT_INDEX].min_interval =  SENSOR_THERMOMETER_STATUS_MIN_INTERVAL;
  cadences[SENSOR_RHT_INDEX].fast_cadence_low.size = sizeof(cadence_low);
  cadences[SENSOR_RHT_INDEX].fast_cadence_low.value = (uint8_t*)(&cadence_low);
  cadences[SENSOR_RHT_INDEX].fast_cadence_high.size = sizeof(cadence_high);
  cadences[SENSOR_RHT_INDEX].fast_cadence_high.value = (uint8_t*)(&cadence_high);
  cadences[SENSOR_RHT_INDEX].status_trigger_delta_down.value = (uint8_t*)(&delta_down);
  cadences[SENSOR_RHT_INDEX].status_trigger_delta_up.value = (uint8_t*)(&delta_up);

  if (SENSOR_THERMOMETER_STATUS_TRIGGER_TYPE_DISCRETE_VALUE == cadences[SENSOR_RHT_INDEX].status_trigger_type) {
    cadences[SENSOR_RHT_INDEX].status_trigger_delta_down.size = sizeof(uint8_t);
    cadences[SENSOR_RHT_INDEX].status_trigger_delta_up.size = sizeof(uint8_t);
  } else {
    cadences[SENSOR_RHT_INDEX].status_trigger_delta_down.size = sizeof(delta_down);
    cadences[SENSOR_RHT_INDEX].status_trigger_delta_up.size = sizeof(delta_up);
  }

  prev_temp_data = temperature;
}

uint32_t sl_btmesh_sensor_thermometer_handle_cadence(temperature_8_t temperature, sl_btmesh_evt_sensor_server_publish_t publish_period)
{
  uint32_t ret_timer_value = publish_period.period_ms;

  // Check if the measured value requires publishing period modification
  if (sensor_thermometer_delta_cadence(temperature)
      || sensor_thermometer_fast_cadence(temperature)) {
    // Calculate publishing timer value
    ret_timer_value = publish_period.period_ms / (1 << cadences[SENSOR_RHT_INDEX].period_divisor);
    if (ret_timer_value < (uint32_t)(1 << cadences[SENSOR_RHT_INDEX].min_interval)) {
      ret_timer_value = (uint32_t)(1 << cadences[SENSOR_RHT_INDEX].min_interval);
    }
  }
  prev_temp_data = temperature;

  return ret_timer_value;
}

bool sl_btmesh_sensor_thermometer_set_cadence(sl_btmesh_evt_sensor_setup_server_set_cadence_request_t* evt)
{
  bool ret_val = false;

  // Check if the received parameters are in valid range
  if ((MAX_PERIOD_DIVISOR >= evt->period_divisor)
      && (MAX_TRIGGER_TYPE >= evt->trigger_type)) {
    if ((SENSOR_THERMOMETER_STATUS_TRIGGER_TYPE_PERCENTAGE == evt->trigger_type)
        && (SENSOR_THERMOMETER_CADENCE_PERCENTAGE_PARAM_LEN == evt->params.len)
        && (MAX_PUBLISHING_MIN_INTERVAL >= evt->params.data[4])) {
      ret_val = true;
    } else if ((SENSOR_THERMOMETER_STATUS_TRIGGER_TYPE_DISCRETE_VALUE == evt->trigger_type)
               && (SENSOR_THERMOMETER_CADENCE_DISCRETE_PARAM_LEN == evt->params.len)
               && (MAX_PUBLISHING_MIN_INTERVAL >= evt->params.data[2])) {
      ret_val = true;
    } else {
    }
  }

  // store incoming thermometer sensor cadence parameters
  if (true == ret_val) {
    if ( SENSOR_THERMOMETER_STATUS_TRIGGER_TYPE_PERCENTAGE == evt->trigger_type) {
      cadences[SENSOR_RHT_INDEX].period_divisor = evt->period_divisor;
      cadences[SENSOR_RHT_INDEX].status_trigger_type = evt->trigger_type;
      cadences[SENSOR_RHT_INDEX].status_trigger_delta_down.value[0] = evt->params.data[1];
      cadences[SENSOR_RHT_INDEX].status_trigger_delta_down.value[1] = evt->params.data[0];
      cadences[SENSOR_RHT_INDEX].status_trigger_delta_up.value[0] = evt->params.data[3];
      cadences[SENSOR_RHT_INDEX].status_trigger_delta_up.value[1] = evt->params.data[2];
      cadences[SENSOR_RHT_INDEX].min_interval = evt->params.data[4];
      cadences[SENSOR_RHT_INDEX].fast_cadence_low.value[0] = evt->params.data[5];
      cadences[SENSOR_RHT_INDEX].fast_cadence_high.value[0] = evt->params.data[6];
      // In case of SENSOR_THERMOMETER_STATUS_TRIGGER_TYPE_DISCRETE_VALUE trigger type
    } else {
      cadences[SENSOR_RHT_INDEX].period_divisor = evt->period_divisor;
      cadences[SENSOR_RHT_INDEX].status_trigger_type = evt->trigger_type;
      cadences[SENSOR_RHT_INDEX].status_trigger_delta_down.value[0] = evt->params.data[0];
      cadences[SENSOR_RHT_INDEX].status_trigger_delta_up.value[0] = evt->params.data[1];
      cadences[SENSOR_RHT_INDEX].min_interval = evt->params.data[2];
      cadences[SENSOR_RHT_INDEX].fast_cadence_low.value[0] = evt->params.data[3];
      cadences[SENSOR_RHT_INDEX].fast_cadence_high.value[0] = evt->params.data[4];
    }
  }

  return ret_val;
}

uint16_t sl_btmesh_sensor_thermometer_get_cadence(uint8_t length, uint8_t* get_cadence_buffer)
{
  uint16_t buffer_len = 0;

  if ((SENSOR_THERMOMETER_STATUS_TRIGGER_TYPE_PERCENTAGE == cadences[SENSOR_RHT_INDEX].status_trigger_type)
      && (SENSOR_THERMOMETER_PERCENTAGE_GET_CADENCE_BUF_LEN <= length)) {
    get_cadence_buffer[0] = cadences[SENSOR_RHT_INDEX].period_divisor
                            | (cadences[SENSOR_RHT_INDEX].status_trigger_type << STATUS_TRIGGER_TYPE_SHIFT);
    get_cadence_buffer[1] = cadences[SENSOR_RHT_INDEX].status_trigger_delta_down.value[1];
    get_cadence_buffer[2] = cadences[SENSOR_RHT_INDEX].status_trigger_delta_down.value[0];
    get_cadence_buffer[3] = cadences[SENSOR_RHT_INDEX].status_trigger_delta_up.value[1];
    get_cadence_buffer[4] = cadences[SENSOR_RHT_INDEX].status_trigger_delta_up.value[0];
    get_cadence_buffer[5] = cadences[SENSOR_RHT_INDEX].min_interval;
    get_cadence_buffer[6] = cadences[SENSOR_RHT_INDEX].fast_cadence_low.value[0];
    get_cadence_buffer[7] = cadences[SENSOR_RHT_INDEX].fast_cadence_high.value[0];
    buffer_len = SENSOR_THERMOMETER_PERCENTAGE_GET_CADENCE_BUF_LEN;
  } else if ((SENSOR_THERMOMETER_STATUS_TRIGGER_TYPE_DISCRETE_VALUE == cadences[SENSOR_RHT_INDEX].status_trigger_type)
             && (SENSOR_THERMOMETER_DISCRETE_GET_CADENCE_BUF_LEN <= length)) {
    get_cadence_buffer[0] = cadences[SENSOR_RHT_INDEX].period_divisor
                            | (cadences[SENSOR_RHT_INDEX].status_trigger_type << STATUS_TRIGGER_TYPE_SHIFT);
    get_cadence_buffer[1] = cadences[SENSOR_RHT_INDEX].status_trigger_delta_down.value[0];
    get_cadence_buffer[2] = cadences[SENSOR_RHT_INDEX].status_trigger_delta_up.value[0];
    get_cadence_buffer[3] = cadences[SENSOR_RHT_INDEX].min_interval;
    get_cadence_buffer[4] = cadences[SENSOR_RHT_INDEX].fast_cadence_low.value[0];
    get_cadence_buffer[5] = cadences[SENSOR_RHT_INDEX].fast_cadence_high.value[0];
    buffer_len = SENSOR_THERMOMETER_DISCRETE_GET_CADENCE_BUF_LEN;
  } else {
  }

  return buffer_len;
}

/***************************************************************************//**
 * Check if the measured value requires publishing period modification.
 *
 * @param[in] temperature     Thermometer sensor data value.
 *
 * @return True if modification is required false otherwise
 ******************************************************************************/
static bool sensor_thermometer_fast_cadence(temperature_8_t temperature)
{
  bool ret_val = false;

  // Check if the Fast Cadence High value is equal or higher than the Fast Cadence Low value
  if ((temperature_8_t)(cadences[SENSOR_RHT_INDEX].fast_cadence_high.value[0])
      >= (temperature_8_t)(cadences[SENSOR_RHT_INDEX].fast_cadence_low.value[0])) {
    // If the measured value is within the closed interval of
    // [Fast Cadence Low, Fast Cadence High], Sensor Status publishing period
    // modification is required.
    if ((temperature >= (temperature_8_t)(cadences[SENSOR_RHT_INDEX].fast_cadence_low.value[0]))
        && (temperature <= (temperature_8_t)(cadences[SENSOR_RHT_INDEX].fast_cadence_high.value[0]))) {
      ret_val = true;
    }
    // If the Fast Cadence High value is lower than the Fast Cadence Low value
  } else {
    // If the measured value is lower than the Fast Cadence High value or is
    // higher than the Fast Cadence Low value, Sensor Status publishing period
    // modification is required.
    if ((temperature < (temperature_8_t)(cadences[SENSOR_RHT_INDEX].fast_cadence_high.value[0]))
        || (temperature > (temperature_8_t)(cadences[SENSOR_RHT_INDEX].fast_cadence_low.value[0]))) {
      ret_val = true;
    }
  }

