espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/bluetooth/common/btmesh_sensor_server/sl_btmesh_sensor_server_cadence.c
  return ret_val;
}

/***************************************************************************//**
 * Check if the change of the measured value requires publishing period modification.
 *
 * @param[in] temperature     Thermometer sensor data value.
 *
 * @return True if modification is required false otherwise
 ******************************************************************************/
static bool sensor_thermometer_delta_cadence(temperature_8_t temperature)
{
  bool ret_val = false;
  uint16_t delta_percent;
  uint16_t percent_delta_up_value;
  uint16_t percent_delta_down_value;

  // Check the unit and format of the Status Trigger Delta Down and
  // the Status Trigger Delta Up fields.
  if (SENSOR_THERMOMETER_STATUS_TRIGGER_TYPE_DISCRETE_VALUE == cadences[SENSOR_RHT_INDEX].status_trigger_type) {
    // If the temperature change is rising edge and the measured quantity change
    // exceeds the configured Status Trigger Delta Up value, the Sensor Status
    // messages are published more frequently.
    if ((temperature > prev_temp_data)
        && ((temperature - prev_temp_data) >= (temperature_8_t)(cadences[SENSOR_RHT_INDEX].status_trigger_delta_up.value[0]))) {
      ret_val = true;
      // If the temperature change is rising edge and the measured quantity change
      // exceeds the configured Status Trigger Delta Up value, the Sensor Status
      // messages are published more frequently.
    } else if ((temperature < prev_temp_data)
               && ((prev_temp_data - temperature) >= (temperature_8_t)(cadences[SENSOR_RHT_INDEX].status_trigger_delta_down.value[0]))) {
      ret_val = true;
    } else {
    }
    // Same check with measured value represented unitless as percentage
  } else if ((SENSOR_THERMOMETER_STATUS_TRIGGER_TYPE_PERCENTAGE == cadences[SENSOR_RHT_INDEX].status_trigger_type)
             && (prev_temp_data != temperature)) {
    percent_delta_down_value = (uint16_t)(cadences[SENSOR_RHT_INDEX].status_trigger_delta_down.value[0]
                                          | (cadences[SENSOR_RHT_INDEX].status_trigger_delta_down.value[1] << FAST_CADENCE_DELTA_SHIFT));
    percent_delta_up_value = (uint16_t)(cadences[SENSOR_RHT_INDEX].status_trigger_delta_up.value[0]
                                        | (cadences[SENSOR_RHT_INDEX].status_trigger_delta_up.value[1] << FAST_CADENCE_DELTA_SHIFT));

    if (!prev_temp_data) {
      delta_percent = PERCENTAGE_FULL;
    } else {
      delta_percent = delta_abs((delta_abs(prev_temp_data - temperature) * PERCENTAGE_FULL) / prev_temp_data);
    }

    if ((temperature > prev_temp_data) && (delta_percent >= percent_delta_up_value)) {
      ret_val = true;
    } else if ((temperature < prev_temp_data) && (delta_percent >= percent_delta_down_value)) {
      ret_val = true;
    } else {
    }
  } else {
  }

  return ret_val;
}

#endif // SENSOR_THERMOMETER_CADENCE

#if SENSOR_THERMOMETER_CADENCE || SENSOR_PEOPLE_COUNT_CADENCE
// Return the absolute value of val.
static int delta_abs(int val)
{
  return val < 0 ? -val : val;
}
#endif
